Revit 2027 API
XYZ.CrossProduct Method
The cross product of this vector and the specified vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ CrossProduct(
	XYZ source
)
Public Function CrossProduct (
	source As XYZ
) As XYZ
public:
XYZ^ CrossProduct(
	XYZ^ source
)
member CrossProduct :
        source : XYZ -> XYZ
Parameters
source XYZ
The vector to multiply with this vector.
Return Value
XYZ
The vector equal to the cross product.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
Remarks
 The cross product is defined as the vector which is perpendicular to both vectors with a magnitude equal to the area of the parallelogram they span. Also known as vector product or outer product.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace